# PDFExportOptions Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
PDFExportOptions Constructor
PDFExportOptions Class See Also
---
Creates a default options object.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public PDFExportOptions()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
PDFExportOptions()
```

# See Also
PDFExportOptions Class
Autodesk.Revit.DB Namespace